# python dataframe

In [1]:
import pandas as pd

In [2]:
empt_df = pd.DataFrame() # creating empty dataframe
print(empt_df)

Empty DataFrame
Columns: []
Index: []

In [3]:
# creating dataframe from a list
lst = ['a', 'b', 'c']
print(lst)

['a', 'b', 'c']

In [4]:
df1 = pd.DataFrame(lst) # in dataframe each column have their name or index
print(df1)

   0
0  a
1  b
2  c

In [5]:
df2 = pd.Series(lst) # in series column does not have their name and index
print(df2)

0    a
1    b
2    c
dtype: object

In [6]:
df1 # its feature of jupyter notebook that we can print the element by its name

   0
0  a
1  b
2  c

In [7]:
df2

0    a
1    b
2    c
dtype: object

In [8]:
lst_of_lst = [[1,2,3], [2,3,4], [4,5,6]]
print(lst_of_lst)

[[1, 2, 3], [2, 3, 4], [4, 5, 6]]

In [9]:
df3 = pd.DataFrame(lst_of_lst) # creating dataframe from list of list

In [10]:
df3

   0  1  2
0  1  2  3
1  2  3  4
2  4  5  6

In [11]:
# now creating dataframe from dictionary
dict1 = {'name':['manish', 'vibhishan', 'vikas', 'vishwa', 'Rohit'],
        'roll_no':[30,47,28,14,11]}
dict1

{'name': ['manish', 'vibhishan', 'vikas', 'vishwa', 'Rohit'],
 'roll_no': [30, 47, 28, 14, 11]}

In [12]:
df4 = pd.DataFrame(dict1)
df4

        name  roll_no
0     manish       30
1  vibhishan       47
2      vikas       28
3     vishwa       14
4      Rohit       11

In [13]:
# now creating datframe from list of dictionaries
ls_dict = [{'id':[12,13,14,15,],'name':['Manish', 'Vikas', 'Vibhishan', 'Rohit']}, 
           {'id':[1,2,3],'name':['Shubham', 'Bipul', 'Vishwa']}]
pd.DataFrame(ls_dict)

                 id                               name
0  [12, 13, 14, 15]  [Manish, Vikas, Vibhishan, Rohit]
1         [1, 2, 3]           [Shubham, Bipul, Vishwa]

In [14]:
# if dictionary are unequal
ls_dict1 = [{'id':[12,13,14,15,],'name':['Manish', 'Vikas', 'Vibhishan', 'Rohit']}, 
           {'id':[1,2,3],'name':['Shubham', 'Bipul', 'Vishwa'], 'character':['better','good', 'very good']}]
pd.DataFrame(ls_dict1)

,id,name,character
0,"[12, 13, 14, 15]","[Manish, Vikas, Vibhishan, Rohit]",NaN
1,"[1, 2, 3]","[Shubham, Bipul, Vishwa]","[better, good, very good]"

In [16]:
# see in above dataframe, in first dictionary charcater was not available so it is showing NaN and in second dict it 
# is available

In [21]:
# creating dataframe of dict of series
dict_of_series = {'id':pd.Series([1,2,3]), 'name':pd.Series(['Manish', 'Krishna', 'Golu'])}
pd.DataFrame(dict_of_series)

   id     name
0   1   Manish
1   2  Krishna
2   3     Golu